```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy

Terraform will perform the following actions:

  # aws_cloudfront_distribution.cf_distribution will be created
+   resource "aws_cloudfront_distribution" "cf_distribution" {
+       arn                            = (known after apply)
+       caller_reference               = (known after apply)
+       default_root_object            = "index.html"
+       domain_name                    = (known after apply)
+       enabled                        = true
+       etag                           = (known after apply)
+       hosted_zone_id                 = (known after apply)
+       http_version                   = "http2"
+       id                             = (known after apply)
+       in_progress_validation_batches = (known after apply)
+       is_ipv6_enabled                = true
+       last_modified_time             = (known after apply)
+       price_class                    = "PriceClass_100"
+       retain_on_delete               = true
+       status                         = (known after apply)
+       tags_all                       = (known after apply)
+       trusted_key_groups             = (known after apply)
+       trusted_signers                = (known after apply)
+       wait_for_deployment            = true

+       custom_error_response {
+           error_caching_min_ttl = 300
+           error_code            = 403
+           response_code         = 200
+           response_page_path    = "/index.html"
        }
+       custom_error_response {
+           error_caching_min_ttl = 300
+           error_code            = 404
+           response_code         = 200
+           response_page_path    = "/index.html"
        }

+       default_cache_behavior {
+           allowed_methods        = [
+               "GET",
+               "HEAD",
+               "OPTIONS",
            ]
+           cached_methods         = [
+               "GET",
+               "HEAD",
            ]
+           compress               = true
+           default_ttl            = 3600
+           max_ttl                = 86400
+           min_ttl                = 0
+           target_origin_id       = "aws-hosted-react-staging"
+           trusted_key_groups     = (known after apply)
+           trusted_signers        = (known after apply)
+           viewer_protocol_policy = "redirect-to-https"

+           forwarded_values {
+               headers                 = (known after apply)
+               query_string            = false
+               query_string_cache_keys = (known after apply)

+               cookies {
+                   forward           = "none"
+                   whitelisted_names = (known after apply)
                }
            }
        }

+       ordered_cache_behavior {
+           allowed_methods        = [
+               "GET",
+               "HEAD",
+               "OPTIONS",
            ]
+           cached_methods         = [
+               "GET",
+               "HEAD",
+               "OPTIONS",
            ]
+           compress               = true
+           default_ttl            = 0
+           max_ttl                = 0
+           min_ttl                = 0
+           path_pattern           = "/index.html"
+           target_origin_id       = "aws-hosted-react-staging"
+           viewer_protocol_policy = "redirect-to-https"

+           forwarded_values {
+               headers                 = (known after apply)
+               query_string            = false
+               query_string_cache_keys = (known after apply)

+               cookies {
+                   forward = "none"
                }
            }
        }

+       origin {
+           connection_attempts = 3
+           connection_timeout  = 10
+           domain_name         = "aws-hosted-react-staging.s3.amazonaws.com"
+           origin_id           = "aws-hosted-react-staging"

+           s3_origin_config {
+               origin_access_identity = "origin-access-identity/cloudfront/E2TU1MHZJ2PMW7"
            }
        }

+       restrictions {
+           geo_restriction {
+               locations        = (known after apply)
+               restriction_type = "none"
            }
        }

+       viewer_certificate {
+           cloudfront_default_certificate = true
+           minimum_protocol_version       = "TLSv1"
        }
    }

  # aws_s3_bucket_acl.app_bucket_acl will be destroyed
  # (because aws_s3_bucket_acl.app_bucket_acl is not in configuration)
-   resource "aws_s3_bucket_acl" "app_bucket_acl" {
-       acl    = "public-read" -> null
-       bucket = "aws-hosted-react-staging" -> null
-       id     = "aws-hosted-react-staging,public-read" -> null

-       access_control_policy {
-           grant {
-               permission = "READ" -> null

-               grantee {
-                   type = "Group" -> null
-                   uri  = "http://acs.amazonaws.com/groups/global/AllUsers" -> null
                }
            }
-           grant {
-               permission = "FULL_CONTROL" -> null

-               grantee {
-                   display_name = "mabe.abby.a" -> null
-                   id           = "e0c8bb913d6a77c937ee98e33b16d1f55298e6d718a522c806cdd7f721042cfb" -> null
-                   type         = "CanonicalUser" -> null
                }
            }

-           owner {
-               display_name = "mabe.abby.a" -> null
-               id           = "e0c8bb913d6a77c937ee98e33b16d1f55298e6d718a522c806cdd7f721042cfb" -> null
            }
        }
    }

  # aws_s3_object.static_files["asset-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "static_files" {
      ~ acl                = "public-read" -> "private"
        id                 = "asset-manifest.json"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.static_files["favicon.ico"] will be updated in-place
  ~ resource "aws_s3_object" "static_files" {
      ~ acl                = "public-read" -> "private"
        id                 = "favicon.ico"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.static_files["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "static_files" {
      ~ acl                = "public-read" -> "private"
        id                 = "index.html"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.static_files["logo192.png"] will be updated in-place
  ~ resource "aws_s3_object" "static_files" {
      ~ acl                = "public-read" -> "private"
        id                 = "logo192.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.static_files["logo512.png"] will be updated in-place
  ~ resource "aws_s3_object" "static_files" {
      ~ acl                = "public-read" -> "private"
        id                 = "logo512.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.static_files["manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "static_files" {
      ~ acl                = "public-read" -> "private"
        id                 = "manifest.json"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.static_files["robots.txt"] will be updated in-place
  ~ resource "aws_s3_object" "static_files" {
      ~ acl                = "public-read" -> "private"
        id                 = "robots.txt"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.static_files["static/css/main.22941023.css"] will be updated in-place
  ~ resource "aws_s3_object" "static_files" {
      ~ acl                = "public-read" -> "private"
        id                 = "static/css/main.22941023.css"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.static_files["static/css/main.22941023.css.map"] will be updated in-place
  ~ resource "aws_s3_object" "static_files" {
      ~ acl                = "public-read" -> "private"
        id                 = "static/css/main.22941023.css.map"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.static_files["static/js/main.9ba1114e.js"] will be updated in-place
  ~ resource "aws_s3_object" "static_files" {
      ~ acl                = "public-read" -> "private"
        id                 = "static/js/main.9ba1114e.js"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.static_files["static/js/main.9ba1114e.js.LICENSE.txt"] will be updated in-place
  ~ resource "aws_s3_object" "static_files" {
      ~ acl                = "public-read" -> "private"
        id                 = "static/js/main.9ba1114e.js.LICENSE.txt"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.static_files["static/js/main.9ba1114e.js.map"] will be updated in-place
  ~ resource "aws_s3_object" "static_files" {
      ~ acl                = "public-read" -> "private"
        id                 = "static/js/main.9ba1114e.js.map"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

Plan: 1 to add, 12 to change, 1 to destroy.
```